save:   .word 0  #save[0] = 5
        .word 1  #save[1] = 5

Main:	addi $10, $00, save	# save[0]のアドレス
    	lw $19, 0($10)		# 一つ目を保持
	    lw $20, 4($10)		# 二つ目を保持
	    addi $21, $00, 2	# カウンタを保持
	    sll $22, $21, 2		# カウンタの数字をアドレスの差分に変換
	    addi $23, $00, 21	# ループの上限を保持．ただし回数＋１を持たせる

	    beq $21, $22, Exit

Loop:	add $24, $19, $20	# $24に次の項を一時的に代入
	    add $25, $10, $22	# $25に次の項をストアするメモリのアドレスを保持
	    sw $24, 0($25)
	    add $19, $00, $20
	    add $20, $00, $24
	    addi $21, $21, 1
	    sll $22, $21, 2		# カウンタの数字をアドレスの差分に変換
	    bne $21, $23, Loop

Exit:	jr $31
